<!-- add-pr-comment:eks_plan -->

# staging/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_log_metric_filter.velero-error[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "velero-error" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "velero-error"
      + pattern                   = "{ ($.kubernetes.pod_name = \"velero*\") && ($.log = *error*) }"
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "velero-error"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_metric_alarm.logs-1-velero-error-5-minute-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-velero-error-5-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Errors In Velero. Verify Backup Status"
      + alarm_name                            = "logs-1-velero-error-5-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "velero-error"
      + namespace                             = "LogMetrics"
      + period                                = 300
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.velero_daemonset_unavailable[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "velero_daemonset_unavailable" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Velero Daemonset Replicas Unavailable"
      + alarm_name                            = "velero-daemonset-replicas-unavailable"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + region                                = "ca-central-1"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
      + metric_query {
          + id          = "m1"
          + return_data = true
            # (3 unchanged attributes hidden)
          + metric {
              + dimensions  = {
                  + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  + "daemonset"   = "node-agent"
                  + "namespace"   = "velero"
                }
              + metric_name = "kube_daemonset_status_number_unavailable"
              + namespace   = "ContainerInsights/Prometheus"
              + period      = 300
              + stat        = "Minimum"
                # (1 unchanged attribute hidden)
            }
        }
    }
  # aws_cloudwatch_metric_alarm.velero_deployment_unavailable[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "velero_deployment_unavailable" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Velero Deployment Replicas Unavailable"
      + alarm_name                            = "velero-deployment-replicas-unavailable"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + region                                = "ca-central-1"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
      + metric_query {
          + id          = "m1"
          + return_data = true
            # (3 unchanged attributes hidden)
          + metric {
              + dimensions  = {
                  + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  + "deployment"  = "velero"
                  + "namespace"   = "velero"
                }
              + metric_name = "kube_deployment_status_replicas_unavailable"
              + namespace   = "ContainerInsights/Prometheus"
              + period      = 300
              + stat        = "Minimum"
                # (1 unchanged attribute hidden)
            }
        }
    }
  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ (sensitive value),
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
        }
        # (30 unchanged attributes hidden)
        # (4 unchanged blocks hidden)
    }
Plan: 4 to add, 1 to change, 0 to destroy.

# --- End of Plan 1 ---